Repository: CofficLab/LumiPluginToast
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Any plugin calls the toast service with a message and style.
zh_hans: 任何插件都可携带消息与样式调用 toast 服务。
zh_hk: 任何外掛程式都可攜帶訊息與樣式呼叫 toast 服務。

source: Auto-Dismiss
zh_hans: 自动消失
zh_hk: 自動消失

source: Auto-dismiss
zh_hans: 自动消失
zh_hk: 自動消失

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Dismiss
zh_hans: 消失
zh_hk: 消失

source: Display
zh_hans: 显示
zh_hk: 顯示

source: Each toast fades away on its own after a few seconds.
zh_hans: 每条 toast 几秒后自行淡出。
zh_hk: 每則 toast 幾秒後自行淡出。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Lightweight notifications that never get in your way.
zh_hans: 轻量通知，从不打扰你的工作流。
zh_hk: 輕量通知，從不打擾你的工作流程。

source: Non-blocking
zh_hans: 不阻塞
zh_hk: 不阻塞

source: Rapid-fire messages refresh the current toast instead of stacking.
zh_hans: 高频消息刷新当前 toast，而不是堆叠成串。
zh_hk: 高頻訊息重新整理目前 toast，而不是堆疊成串。

source: Replacement Throttle
zh_hans: 替换式节流
zh_hk: 替換式節流

source: Show
zh_hans: 展示
zh_hk: 顯示

source: The root overlay renders the toast at the top of the window.
zh_hans: 根覆盖层把 toast 渲染在窗口顶部。
zh_hk: 根覆蓋層把 toast 渲染在視窗頂部。

source: The timer clears it automatically — or a newer toast takes its place.
zh_hans: 计时器自动清除，或由更新的 toast 取而代之。
zh_hk: 計時器自動清除，或由更新的 toast 取而代之。

source: Throttled
zh_hans: 节流防堆叠
zh_hk: 節流防堆疊

source: Toasts render at the top of the window, above all content.
zh_hans: toast 渲染在窗口顶部、所有内容之上。
zh_hk: toast 渲染在視窗頂部、所有內容之上。

source: Top Overlay
zh_hans: 顶部覆盖层
zh_hk: 頂部覆蓋層

source: default duration
zh_hans: 默认时长
zh_hk: 預設時長

source: display position
zh_hans: 显示位置
zh_hk: 顯示位置

source: Close
zh_hans: 关闭
zh_hk: 關閉

source: Error details
zh_hans: 错误详情
zh_hk: 錯誤詳細資料
